Tekla.Structures.Model.PourObject
The PourObject class represents a pour object in the model.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam beam = new Beam(new Point(1000, 1000, 400), new Point(3000, 1000, 400));
beam.Profile.ProfileString = "380*380";
beam.Material.MaterialString = "K40-1";
beam.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam.Insert())
{
Beam beam2 = new Beam(new Point(800, 1000, 0), new Point(800, 1000, 3000));
beam2.Profile.ProfileString = "380*380";
beam2.Material.MaterialString = "K40-1";
beam2.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam2.Insert())
{
new Model().CommitChanges();
ModelObjectEnumerator pours = beam.GetPours();
while(pours.MoveNext())
{
Pour pour = pours.Current as Pour;
if(pour != null)
{
Solid solid = pour.GetSolid();
if(solid != null)
Console.WriteLine("Fetching solid from pour successfull!");
}
}
}
}
}
}

Tekla.Structures.Model.PourObject.#ctor
Creates a new pour object.
The default values are as follows:
Class = 0;

Tekla.Structures.Model.PourObject.Insert
At the moment pour objects cannot be inserted.
Returns: False.

Tekla.Structures.Model.PourObject.Delete
At the moment pour objects cannot be deleted.
Returns: False.

Tekla.Structures.Model.PourObject.GetAssembly
Returns the assembly that the pour object belongs to.
Returns: The assembly that the pour object belongs to.

Tekla.Structures.Model.PourObject.Class
The class of the pour object.